cylinderMeshLarge/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.0016;

vertices
(
    //back_inner
    (0.5 0 -37.5)
    (0 0.5 -37.5)
    (-0.5 0 -37.5)
    (0 -0.5 -37.5)
    //back_outer
    (2 0 -37.5)
    (0 2 -37.5)
    (-2 0 -37.5)
    (0 -2 -37.5)
    //front_inner
    (0.5 0 37.5)
    (0 0.5 37.5)
    (-0.5 0 37.5)
    (0 -0.5 37.5)
    //front_outer
    (2 0 37.5)
    (0 2 37.5)
    (-2 0 37.5)
    (0 -2 37.5)
);

edges
(
    //back_inner
    arc 0 1 (0.353553390593 0.3535533905932 -37.5)
    arc 1 2 (-0.353553390593 0.3535533905932 -37.5)
    arc 2 3 (-0.353553390593 -0.3535533905932 -37.5)
    arc 3 0 (0.353553390593 -0.3535533905932 -37.5)
    //back_outer
    arc 4 5 (1.414213562373 1.414213562373 -37.5)
    arc 5 6 (-1.414213562373 1.414213562373 -37.5)
    arc 6 7 (-1.414213562373 -1.414213562373 -37.5)
    arc 7 4 (1.414213562373 -1.414213562373 -37.5)
    //front_inner
    arc 8 9 (0.353553390593 0.3535533905932 37.5)
    arc 9 10 (-0.353553390593 0.3535533905932 37.5)
    arc 10 11 (-0.353553390593 -0.3535533905932 37.5)
    arc 11 8 (0.353553390593 -0.3535533905932 37.5)
    //front_outer
    arc 12 13 (1.414213562373 1.414213562373 37.5)
    arc 13 14 (-1.414213562373 1.414213562373 37.5)
    arc 14 15 (-1.414213562373 -1.414213562373 37.5)
    arc 15 12 (1.414213562373 -1.414213562373 37.5)
);

blocks
(
    hex (0 4 5 1 8 12 13 9) (30 30 1) simpleGrading (6 1 1)
    hex (1 5 6 2 9 13 14 10) (30 30 1) simpleGrading (6 1 1)
    hex (2 6 7 3 10 14 15 11) (30 30 1) simpleGrading (6 1 1)
    hex (3 7 4 0 11 15 12 8) (30 30 1) simpleGrading (6 1 1)
);

boundary
(
    overset2
    {
        type        overset;
        faces
        (
            (5 13 12 4)
            (6 14 13 5)
            (7 15 14 6)
            (4 12 15 7)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 8 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)

            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
            (11 15 12 8)
        );
    }
);

// ************************************************************************* //
